## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_acm_certificate.cds-snc-ca`                                  |
|        | `aws_acm_certificate_validation.cds-snc-ca`                       |
|        | `aws_cloudfront_distribution.cds-snc-ca`                          |
|        | `aws_cloudfront_function.cds-snc-ca-security-txt`                 |
|        | `aws_route53_record.cds-snc-ca-cert-validation[&quot;cds-snc.ca&quot;]`     |
|        | `aws_route53_record.cds-snc-ca-cert-validation[&quot;www.cds-snc.ca&quot;]` |
|        | `aws_route53_record.www-cds-snc-ca-A`                             |
| update | `aws_iam_policy.Route53TerraformDeploy`                           |
|        | `aws_route53_record.cds-snc-ca-A`                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate.cds-snc-ca will be created
  + resource "aws_acm_certificate" "cds-snc-ca" {
      + arn                       = (known after apply)
      + domain_name               = "cds-snc.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "cds-snc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.cds-snc.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "cds-snc.ca",
          + "www.cds-snc.ca",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.cds-snc-ca will be created
  + resource "aws_acm_certificate_validation" "cds-snc-ca" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.cds-snc-ca will be created
  + resource "aws_cloudfront_distribution" "cds-snc-ca" {
      + aliases                         = [
          + "cds-snc.ca",
          + "www.cds-snc.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "cds-snc.ca apex and www - security.txt and redirect"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "dummy"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "example.com"
          + origin_id                = "dummy"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_function.cds-snc-ca-security-txt will be created
  + resource "aws_cloudfront_function" "cds-snc-ca-security-txt" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var uri = event.request.uri;
                  
              if (uri === '/.well-known/security.txt') {
                return {
                  statusCode: 200,
                  statusDescription: 'OK',
                  headers: {
                    'content-type': { value: 'text/plain' }
                  },
                  body: 'Contact: mailto:ZZTBSCYBERS@tbs-sct.gc.ca\nContact: https://hackerone.com/tbs-sct/\nPolicy: https://hackerone.com/tbs-sct/policy\nCanonical: https://alpha.canada.ca/.well-known/security.txt\nPreferred-Languages: en, fr\nExpires: 2026-03-02T12:00:00.000Z'
                };
              }
                  
              return {
                statusCode: 301,
                statusDescription: 'Moved Permanently',
                headers: {
                  'location': { value: 'https://digital.canada.ca/' }
                }
              };
            }
        EOT
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "cds-snc-ca-security-txt"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_iam_policy.Route53TerraformDeploy will be updated in-place
  ~ resource "aws_iam_policy" "Route53TerraformDeploy" {
        id               = "arn:aws:iam::866996500832:policy/Route53TerraformDeploy"
        name             = "Route53TerraformDeploy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "route53:*",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "acm:RequestCertificate",
                          + "acm:DescribeCertificate",
                          + "acm:DeleteCertificate",
                          + "acm:ListTagsForCertificate",
                          + "acm:AddTagsToCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:acm:us-east-1:866996500832:certificate/*"
                    },
                  + {
                      + Action   = [
                          + "acm:ListCertificates",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cloudfront:CreateFunction",
                          + "cloudfront:UpdateFunction",
                          + "cloudfront:DeleteFunction",
                          + "cloudfront:DescribeFunction",
                          + "cloudfront:PublishFunction",
                          + "cloudfront:GetFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::866996500832:function/cds-snc-ca-security-txt"
                    },
                  + {
                      + Action   = [
                          + "cloudfront:CreateDistribution",
                          + "cloudfront:GetDistribution",
                          + "cloudfront:GetDistributionConfig",
                          + "cloudfront:UpdateDistribution",
                          + "cloudfront:DeleteDistribution",
                          + "cloudfront:TagResource",
                          + "cloudfront:ListTagsForResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::866996500832:distribution/*"
                    },
                  + {
                      + Action   = [
                          + "cloudfront:ListDistributions",
                          + "cloudfront:ListFunctions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                    {
                        Action   = [
                            "s3:ListBucket",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::cds-dns-terraform-state",
                        ]
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::cds-dns-terraform-state/*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (8 unchanged elements hidden)
                            "iam:ListPolicyVersions",
                          + "iam:DeletePolicyVersion",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "iam:CreatePolicyVersion",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::866996500832:policy/notify_prod_dns_manager_policy",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_route53_record.cds-snc-ca-A will be updated in-place
  ~ resource "aws_route53_record" "cds-snc-ca-A" {
        id                               = "Z35N8HLYUZDWBH_cds-snc.ca_A"
        name                             = "cds-snc.ca"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = true -> false
          ~ name                   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3AQBSTGFYJSTF" -> (known after apply)
        }
    }

  # aws_route53_record.cds-snc-ca-cert-validation["cds-snc.ca"] will be created
  + resource "aws_route53_record" "cds-snc-ca-cert-validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.cds-snc-ca-cert-validation["www.cds-snc.ca"] will be created
  + resource "aws_route53_record" "cds-snc-ca-cert-validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.www-cds-snc-ca-A will be created
  + resource "aws_route53_record" "www-cds-snc-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.cds-snc.ca"
      + type            = "A"
      + zone_id         = "Z35N8HLYUZDWBH"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 7 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.cds-snc-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.cds-snc-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.gcdigital-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
